tranthinhembedded/PIC16F887-/1.LEDDON/VD3.X/VD3.c
#pragma config FOSC = HS        // Oscillator Selection bits (HS oscillator: High-speed crystal/resonator on RA6/OSC2/CLKOUT and RA7/OSC1/CLKIN)
#pragma config WDTE = OFF       // Watchdog Timer Enable bit (WDT disabled and can be enabled by SWDTEN bit of the WDTCON register)
#pragma config PWRTE = OFF      // Power-up Timer Enable bit (PWRT disabled)
#pragma config MCLRE = ON       // RE3/MCLR pin function select bit (RE3/MCLR pin function is MCLR)
#pragma config CP = OFF         // Code Protection bit (Program memory code protection is disabled)
#pragma config CPD = OFF        // Data Code Protection bit (Data memory code protection is disabled)
#pragma config BOREN = OFF      // Brown Out Reset Selection bits (BOR disabled)
#pragma config IESO = OFF       // Internal External Switchover bit (Internal/External Switchover mode is disabled)
#pragma config FCMEN = OFF      // Fail-Safe Clock Monitor Enabled bit (Fail-Safe Clock Monitor is disabled)
#pragma config LVP = OFF        // Low Voltage Programming Enable bit (RB3 pin has digital I/O, HV on MCLR must be used for programming)

// CONFIG2
#pragma config BOR4V = BOR40V   // Brown-out Reset Selection bit (Brown-out Reset set to 4.0V)
#pragma config WRT = OFF        // Flash Program Memory Self Write Enable bits (Write protection off)

// #pragma config statements should precede project file includes.
// Use project enums instead of #define for ON and OFF.

#include <xc.h>
#define _XTAL_FREQ 4000000

void main(void) 
{
    ANSEL = 0;   
    ANSELH = 0;  
    
    TRISD = 0x00;  
    PORTD = 0x00;
    
    while(1)
    {
     //sang D6
    TRISB = 0b00100000;
    PORTB = 0b00001000;
    __delay_ms(400);
    
    //sang D7
    TRISB = 0b00100000;
    PORTB = 0b00010000;
    __delay_ms(400);
    
    //sang D8
    TRISB = 0b00001000;
    PORTB = 0b00010000;
    __delay_ms(400);
    
    //sang D9
    TRISB = 0b00001000; 
    PORTB = 0b00100000;
    __delay_ms(400);
    
    //sang D10
    TRISB = 0b00010000; 
    PORTB = 0b00100000;
    __delay_ms(400);
    
    //sang D11
    TRISB = 0b00010000;
    PORTB = 0b00001000;
    __delay_ms(400);
    
    //sang D10
    TRISB = 0b00010000; 
    PORTB = 0b00100000;
    __delay_ms(400);
    
    //sang D9
    TRISB = 0b00001000; 
    PORTB = 0b00100000;
    __delay_ms(400);
    
    //sang D8
    TRISB = 0b00001000;
    PORTB = 0b00010000;
    __delay_ms(400);
    
    //sang D7
    TRISB = 0b00100000;
    PORTB = 0b00010000;
    __delay_ms(400);
    
    //sang D6
    TRISB = 0b00100000;
    PORTB = 0b00001000;
    __delay_ms(400);
    }
      
       
    
    
}